Repository: ziad-zezo/RechargeSnap
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: About
ar: حول

# appTitle
source: Recharge Snap
ar: شحن سريع

source: Cancel
ar: إلغاء

source: Canceled
ar: تم الإلغاء

source: Can't Pick Image
ar: لا يمكن اختيار الصورة

source: Can't Recognize Text
ar: لا يمكن التعرف على النص

source: Confirm
ar: تأكيد

source: Copied to clipboard
ar: تم النسخ إلى الحافظة

source: Copy
ar: نسخ

# correctNumberQuestion
source: Is this the correct number?
ar: هل هذا الرقم صحيح؟

# couldNotLaunchPhone
source: Could not launch phone app
ar: تعذر فتح تطبيق الهاتف

source: Done
ar: تم

source: Enter card number
ar: أدخل كود الشحن

source: Etisalat
ar: اتصالات

# isThisCorrectNumber
source: Is this the correct number?
ar: هل هذا الرقم صحيح؟

# languageCode
source: en
ar: ar

source: No numbers detected
ar: لم يتم اكتشاف أرقام

source: Number Detected
ar: تم اكتشاف الرقم

source: OR ENTER MANUALLY
ar: أو أدخل الرقم يدوياً

source: Orange
ar: اورنج

source: Pick Image
ar: اختر صورة

# pleaseEnterValidNumber
source: Please enter a valid number
ar: الرجاء إدخال رقم صالح

source: Recharge Now
ar: اشحن الآن

# rechargeSuccessMessage
source: Your {provider} card has been recharged successfully
ar: تم شحن بطاقة {provider} بنجاح

source: Recharge Successful!
ar: تم الشحن بنجاح!

source: Retry
ar: إعادة المحاولة

source: Scan Code
ar: مسح الكود

# selectImage
source: Please Select Image
ar: الرجاء اختيار صورة

source: Select Provider
ar: اختر الشركة

source: Settings
ar: الإعدادات

source: Vodafone
ar: فودافون

source: We
ar: وي

source: Back
ar: رجوع

source: Default Provider
ar: شركة الشحن

# providerSetSuccess
source: {provider} Is Default
ar: تم تعيين {provider} كافتراضي

# flashOn
source: Turn Flash On
ar: تشغيل الفلاش

# flashOff
source: Turn Flash Off
ar: ايقاف الفلاش

source: Scan Again
ar: المسح مرة اخرى

source: Align text within frame
ar: ضع الكود بداخل الاطار

source: Language
ar: اللغة

source: Scan Code Using Camera
ar: مسح الكود بالكاميرا

source: Processing...
ar: جار الفحص

# elzoz
source: El ZoOoZ
ar: الزووز
